app/controllers/posts_controller.rb

  def index
    # @posts = Post.all
    if params[:mine]
      @posts = current_user.try(:posts)
    else
      @posts = Post.page(params[:page])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "posts"

  def create
    @post = current_user.posts.new(post_params)
      if @post.save
---
INSERT INTO "posts" ("url", "title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def upvote
    @post = Post.find(params[:id])
    current_user.upvote << @post
---
INSERT INTO "votes" ("votable_id", "votable_type", "voter_id", "voter_type", "vote_flag", "vote_weight", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def set_post
    @post = current_user.post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 2]]