app/controllers/posts_controller.rb

  def index
    if params[:mine]
      @posts = current_user.try(:posts).page(params[:page]).order(:cached_weighted_score => :desc)
---
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."cached_weighted_score" DESC LIMIT 5 OFFSET 0